In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('Courses')

+---------+----------+
| student |  class   |
+---------+----------+
|    A    |   Math   |
|    B    | English  |
|    C    |   Math   |
|    D    | Biology  |
|    E    |   Math   |
|    F    | Computer |
|    G    |   Math   |
|    H    |   Math   |
|    I    |   Math   |
+---------+----------+

### Find all the classes that have at least five students.
```
+---------+
| class   |
+---------+
| Math    |
+---------+
Explanation: 
- Math has 6 students, so we include it.
- English has 1 student, so we do not include it.
- Biology has 1 student, so we do not include it.
- Computer has 1 student, so we do not include it.
```

In [3]:
%%sql 

SELECT class
FROM courses 
GROUP BY class 
HAVING COUNT(class) >= 5;

[('Math',)]

# Using Pandas

In [4]:
course_query = %sql SELECT * FROM Courses # type: ignore 
course_df = course_query.DataFrame()

display(course_df)

  student     class
0       A      Math
1       B   English
2       C      Math
3       D   Biology
4       E      Math
5       F  Computer
6       G      Math
7       H      Math
8       I      Math

In [5]:
course_df['class_count'] = course_df.groupby('class').transform('count')
course_df

  student     class  class_count
0       A      Math            6
1       B   English            1
2       C      Math            6
3       D   Biology            1
4       E      Math            6
5       F  Computer            1
6       G      Math            6
7       H      Math            6
8       I      Math            6

In [6]:
course_df.query("class_count >= 5")

  student class  class_count
0       A  Math            6
2       C  Math            6
4       E  Math            6
6       G  Math            6
7       H  Math            6
8       I  Math            6

In [7]:
course_df.query("class_count >= 5")[['class']]

  class
0  Math
2  Math
4  Math
6  Math
7  Math
8  Math

###  `df.iloc[0, 1]` returns the value in the first row and second column of the DataFrame df.
```py
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
selected_df = df.iloc[[0, 2], :]
print(selected_df)
# Output:
#    A  B  C
# 0  1  4  7
# 2  3  6  9
```

In [8]:
course_df.query("class_count >= 5")[['class']].iloc[: 1]

  class
0  Math